SteveLRojas/MC-10_Tape_Emulator/SW/tape_emulator/user_libs/ch32v203_usbd_cdc.c
/*
 * ch32v203_usbd_cdc.c
 *
 *  Created on: Aug 9, 2024
 *      Author: Steve
 */
#include "ch32v20x.h"
#include "ch32v203_usbd.h"
#include "ch32v203_usbd_cdc.h"
//TODO: what happens if EP_2 receives a zero length packet?
//HINT: For double-buffered endpoints the CH32V203 reference manual does not say when the SW and HW toggles are compared. It also does not say when the STAT_RX/STAT_TX fields are updated and how the endpoint response is determined.
//Here is my current understanding: A double buffered endpoint will respond with ACK only if the SW and HW toggles are different and the STAT_RX/STAT_TX field is set to ACK, otherwise the response is NAK or as specified by STAT_RX/STAT_TX.
//At certain times the STAT_RX/STAT_TX field will be set to NAK by the hardware, this seems to happen when the CTR_RX/CTR_TX flag is cleared if the HW and SW toggles are equal.
//Once the hardware sets the STAT_RX/STAT_TX field to NAK, the user must set it back to ACK before communication on the endpoint resumes.

#define SET_LINE_CODING         0x20  // host configures line coding
#define GET_LINE_CODING         0x21  // host reads configured line coding
#define SET_CONTROL_LINE_STATE  0x22  // generates RS-232/V.24 style control signals
#define SEND_BREAK              0x23  // send break

#define CDC_DEV_DESCR_SIZE 18
#define CDC_CONF_DESCR_SIZE 67
#define CDC_LINE_CODING_SIZE 7
#define CDC_SERIAL_STATE_SIZE 10

/* USB standard device request code */
#ifndef USB_GET_DESCRIPTOR
#define USB_GET_STATUS          0x00
#define USB_CLEAR_FEATURE       0x01
#define USB_SET_FEATURE         0x03
#define USB_SET_ADDRESS         0x05
#define USB_GET_DESCRIPTOR      0x06
#define USB_SET_DESCRIPTOR      0x07
#define USB_GET_CONFIGURATION   0x08
#define USB_SET_CONFIGURATION   0x09
#define USB_GET_INTERFACE       0x0A
#define USB_SET_INTERFACE       0x0B
#define USB_SYNCH_FRAME         0x0C
#endif

/* Bit define for USB request type */
#ifndef USB_REQ_TYP_MASK
#define USB_REQ_TYP_IN          0x80            /* control IN, device to host */
#define USB_REQ_TYP_OUT         0x00            /* control OUT, host to device */
#define USB_REQ_TYP_READ        0x80            /* control read, device to host */
#define USB_REQ_TYP_WRITE       0x00            /* control write, host to device */
#define USB_REQ_TYP_MASK        0x60            /* bit mask of request type */
#define USB_REQ_TYP_STANDARD    0x00
#define USB_REQ_TYP_CLASS       0x20
#define USB_REQ_TYP_VENDOR      0x40
#define USB_REQ_TYP_RESERVED    0x60
#define USB_REQ_RECIP_MASK      0x1F            /* bit mask of request recipient */
#define USB_REQ_RECIP_DEVICE    0x00
#define USB_REQ_RECIP_INTERF    0x01
#define USB_REQ_RECIP_ENDP      0x02
#define USB_REQ_RECIP_OTHER     0x03
#endif

/* USB descriptor type */
#ifndef USB_DESCR_TYP_DEVICE
#define USB_DESCR_TYP_DEVICE    0x01
#define USB_DESCR_TYP_CONFIG    0x02
#define USB_DESCR_TYP_STRING    0x03
#define USB_DESCR_TYP_INTERF    0x04
#define USB_DESCR_TYP_ENDP      0x05
#define USB_DESCR_TYP_QUALIF    0x06
#define USB_DESCR_TYP_SPEED     0x07
#define USB_DESCR_TYP_OTG       0x09
#define USB_DESCR_TYP_HID       0x21
#define USB_DESCR_TYP_REPORT    0x22
#define USB_DESCR_TYP_PHYSIC    0x23
#define USB_DESCR_TYP_CS_INTF   0x24
#define USB_DESCR_TYP_CS_ENDP   0x25
#define USB_DESCR_TYP_HUB       0x29
#endif


uint16_t cdc_last_data_time;
uint16_t cdc_last_status_time;
//volatile uint8_t cdc_tx_enabled;

//HINT:
//For RX double-buffered endpoint (EP_2) DTOG_RX indicates the buffer in use by HW and DTOG_TX indicates the buffer in use by SW.
//For TX double-buffered endpoint (EP_3) DTOG_TX indicates the buffer in use by HW and DTOG_RX indicates the buffer in use by SW.

//HINT: RX rules:
//1: If HW_toggle (EP_2 DTOG_RX) matches SW_toggle (EP_2 DTOG_TX) then move SW_toggle to match ep2_read_select when ep2_read_select changes.
//2: If HW_toggle (EP_2 DTOG_RX) moves then update SW_toggle (EP_2 DTOG_TX) to match ep2_read_select.
uint8_t ep2_read_select;
volatile uint8_t ep2_t0_num_bytes;
uint8_t ep2_t0_read_offset;
volatile uint8_t ep2_t1_num_bytes;
uint8_t ep2_t1_read_offset;

//HINT: TX rules:
//1: If HW_toggle (EP_3 DTOG_TX) matches SW_toggle (EP_3 DTOG_RX) then move SW_toggle to match ep3_write_select when ep3_write_select changes.
//2: If HW_toggle (EP_3 DTOG_TX) moves then update SW_toggle (EP_3 DTOG_RX) to match ep3_write_select.
//3: Update tx_len when SW_toggle (EP_3 DTOG_RX) changes.
volatile uint8_t ep3_wip;
volatile uint8_t ep3_write_select;
volatile uint8_t ep3_t0_num_bytes;
volatile uint8_t ep3_t1_num_bytes;

typedef struct _USB_SETUP_REQ
{
    uint8_t bRequestType;
    uint8_t bRequest;
    uint16_t wValue;
    uint16_t wIndex;
    uint16_t wLength;
} usb_setup_req_t;

usb_setup_req_t cdc_setup_buf __attribute__ ((aligned(2)));

const uint8_t* descriptor_ptr;
uint8_t cdc_address;
uint8_t cdc_config;

volatile cdc_line_coding_t cdc_line_coding __attribute__ ((aligned(2))) = {125000, 0x00, 0x00, 0x08, 0x00};	//125K baud, 1 stop, no parity, 8 data
volatile uint8_t cdc_control_line_state = 0;

/* USB Device Descriptors */
static const uint8_t cdc_device_descriptor[] __attribute__ ((aligned(2))) =
{
    CDC_DEV_DESCR_SIZE,				// bLength
    0x01,                           // bDescriptorType
    0x10, 0x01,                     // bcdUSB
    0x02,                           // bDeviceClass
    0x00,                           // bDeviceSubClass
    0x00,                           // bDeviceProtocol
    CDC_ENDP0_SIZE,					// bMaxPacketSize0
    0x86, 0x1A,                     // idVendor
    0x0C, 0xFE,                     // idProduct
    0x00, 0x01,                     // bcdDevice
    0x01,                           // iManufacturer
    0x02,                           // iProduct
    0x03,                           // iSerialNumber
    0x01,                           // bNumConfigurations
};

/* USB Configuration Descriptors */
static const uint8_t cdc_config_descriptor[] __attribute__ ((aligned(2))) =
{
    /* Configuration Descriptor */
    0x09,                           // bLength
    0x02,                           // bDescriptorType
    CDC_CONF_DESCR_SIZE & 0xFF, CDC_CONF_DESCR_SIZE >> 8, // wTotalLength
    0x02,                           // bNumInterfaces
    0x01,                           // bConfigurationValue
    0x00,                           // iConfiguration
    0x80,                           // bmAttributes: Bus Powered
    0x32,                           // MaxPower: 100mA

