SteveLRojas/MC-10_Tape_Emulator/SW/tape_emulator/user_libs/ch32v203_usbd_cdc.c
    /* Interface 0 (CDC) descriptor */
    0x09,                           // bLength
    0x04,                           // bDescriptorType (Interface)
    0x00,                           // bInterfaceNumber 0
    0x00,                           // bAlternateSetting
    0x01,                           // bNumEndpoints 1
    0x02,                           // bInterfaceClass	(Communications Interface Class)
    0x02,                           // bInterfaceSubClass	 (Abstract Control Model)
    0x01,                           // bInterfaceProtocol	(AT Commands: V.250)
    0x04,                           // iInterface (String Index)

    /* Functional Descriptors */
    0x05, 0x24, 0x00, 0x10, 0x01,	//CDC Header Functional Descriptor (CDC 1.2)

    /* Length/management descriptor */
    0x05, 0x24, 0x01, 0x00, 0x01,	//Call Management Functional Descriptor (interface 1)
    0x04, 0x24, 0x02, 0x02,			//Abstract Control Management Functional Descriptor
    0x05, 0x24, 0x06, 0x00, 0x01,	//Union Functional Descriptor (interface 0, interface 1)

    /* Interrupt upload endpoint descriptor */
    0x07,                           // bLength
    0x05,                           // bDescriptorType (Endpoint)
    0x81,                           // bEndpointAddress (IN/D2H)
    0x03,                           // bmAttributes (Interrupt)
    CDC_ENDP1_SIZE & 0xFF, CDC_ENDP1_SIZE >> 8, // wMaxPacketSize
    0x01,                           // bInterval 1 (unit depends on device speed)

    /* Interface 1 (data interface) descriptor */
    0x09,                           // bLength
    0x04,                           // bDescriptorType (Interface)
    0x01,                           // bInterfaceNumber 1
    0x00,                           // bAlternateSetting
    0x02,                           // bNumEndpoints 2
    0x0A,                           // bInterfaceClass	(Data Interface Class)
    0x00,                           // bInterfaceSubClass
    0x00,                           // bInterfaceProtocol
    0x00,                           // iInterface (String Index)

    /* Endpoint descriptor */
    0x07,                           // bLength
    0x05,                           // bDescriptorType (Endpoint)
    0x02,                           // bEndpointAddress (OUT/H2D)
    0x02,                           // bmAttributes (Bulk)
    CDC_ENDP2_SIZE & 0xFF, CDC_ENDP2_SIZE >> 8, // wMaxPacketSize
    0x00,                           // bInterval 0 (unit depends on device speed)

    /* Endpoint descriptor */
    0x07,                           // bLength
    0x05,                           // bDescriptorType (Endpoint)
    0x83,                           // bEndpointAddress (IN/D2H)
    0x02,                           // bmAttributes (Bulk)
    CDC_ENDP3_SIZE & 0xFF, CDC_ENDP3_SIZE >> 8, // wMaxPacketSize
    0x00                            // bInterval 0 (unit depends on device speed)
};

/* USB String Descriptors */
static const uint8_t cdc_string_lang_id[] __attribute__ ((aligned(2))) =
{
	0x04,
	0x03,
	0x09,
	0x04
};

/* USB Device String Vendor */
static const uint8_t cdc_string_vendor[] __attribute__ ((aligned(2))) =
{
	14,
	0x03,
	'w',0,'c',0,'h',0,'.',0,'c',0,'n',0
};

/* USB Device String Product */
static const uint8_t cdc_string_product[] __attribute__ ((aligned(2))) =
{
    22,
    0x03,
    'U', 0, 'S', 0, 'B', 0, ' ', 0, 'S', 0, 'e', 0, 'r', 0, 'i', 0, 'a', 0, 'l', 0
};

/* USB Device String Serial */
static const uint8_t cdc_string_serial[] __attribute__ ((aligned(2))) =
{
	22,
	0x03,
	'D', 0, 'E', 0, 'A', 0, 'D', 0, 'B', 0, 'E', 0 , 'E', 0, 'F', 0, '0', 0, '1', 0
};

static const uint8_t cdc_serial_state[] __attribute__ ((aligned(2))) = {0xA1, 0x20, 0x00, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00};

void cdc_on_sof(void)
{
	// check for timeout, if the buffer is not being written to then enable transmitting and mark the buffer as full
	if(((uint16_t)(sof_count - cdc_last_data_time) >= (uint16_t)CDC_TIMEOUT_MS) && ((usbd_get_out_toggle(EP_3) && usbd_get_in_toggle(EP_3)) || (!usbd_get_out_toggle(EP_3) && !usbd_get_in_toggle(EP_3))) && !ep3_wip)
	{
		if(ep3_write_select)
		{
			usbd_set_tx_1_len(EP_3, ep3_t1_num_bytes);
			ep3_t1_num_bytes = CDC_ENDP3_SIZE;
			ep3_write_select = 0;
			//if((usbd_get_out_toggle(EP_3) && usbd_get_in_toggle(EP_3)) || (!usbd_get_out_toggle(EP_3) && !usbd_get_in_toggle(EP_3)))
			//{
				usbd_set_out_toggle(EP_3, USBD_OUT_TOG_0);
			//}
		}
		else
		{
			usbd_set_tx_0_len(EP_3, ep3_t0_num_bytes);
			ep3_t0_num_bytes = CDC_ENDP3_SIZE;
			ep3_write_select = 1;
			//if((usbd_get_out_toggle(EP_3) && usbd_get_in_toggle(EP_3)) || (!usbd_get_out_toggle(EP_3) && !usbd_get_in_toggle(EP_3)))
			//{
				usbd_set_out_toggle(EP_3, USBD_OUT_TOG_1);
			//}
		}
		usbd_set_in_res(EP_3, USBD_IN_RES_ACK);
		//cdc_tx_enabled = 1;
	}

	if((uint16_t)(sof_count - cdc_last_status_time) >= (uint16_t)CDC_TIMEOUT_MS)
	{
		usbd_set_tx_len(EP_1, CDC_SERIAL_STATE_SIZE);
		usbd_set_in_res(EP_1, USBD_IN_RES_ACK);
	}
}

void cdc_on_out(uint8_t ep)
{
	if(ep == EP_0)
	{
		if((cdc_setup_buf.bRequest == SET_LINE_CODING) && ((cdc_setup_buf.bRequestType & USB_REQ_TYP_MASK) == USB_REQ_TYP_CLASS))
		{
			usbd_read_from_pma(usbd_get_rx_buf_offset(EP_0), (uint16_t*)(&cdc_line_coding), (CDC_LINE_CODING_SIZE + 1) >> 1);
		}
		usbd_set_tx_len(EP_0, 0);
		usbd_set_tog_res(EP_0, USBD_OUT_TOG_1 | USBD_IN_TOG_1 | USBD_OUT_RES_ACK | USBD_IN_RES_ACK);
	}

	if(ep == EP_2)
	{
		//auto-toggle is enabled, so here the toggle should point to the next buffer that will receive
		if(usbd_get_out_toggle(EP_2))
		{
			ep2_t0_num_bytes = usbd_get_rx_0_len(EP_2);
			//EP_2 response set to NAK automatically if IN toggle still points to t1 buffer.
		}
		else
		{
			ep2_t1_num_bytes = usbd_get_rx_1_len(EP_2);
			//EP_2 response set to NAK automatically if IN toggle still points to t0 buffer.
		}
		usbd_set_in_toggle(EP_2, ep2_read_select ? USBD_IN_TOG_1 : USBD_IN_TOG_0);
	}
}

void cdc_on_in(uint8_t ep)
{
	uint8_t len;

	if(ep == EP_0)
	{
		if((cdc_setup_buf.bRequestType & USB_REQ_TYP_MASK) == USB_REQ_TYP_STANDARD)
		{
			switch(cdc_setup_buf.bRequest)
			{
			case USB_GET_DESCRIPTOR:
				len = cdc_setup_buf.wLength >= CDC_ENDP0_SIZE ? CDC_ENDP0_SIZE : cdc_setup_buf.wLength;
				usbd_write_to_pma(usbd_get_tx_buf_offset(EP_0), (uint16_t*)descriptor_ptr, (len + 1) >> 1);
				descriptor_ptr += len;
				cdc_setup_buf.wLength -= len;
				usbd_set_tx_len(EP_0, len);
				usbd_set_in_res(EP_0, USBD_IN_RES_ACK);
				break;
			case USB_SET_ADDRESS:
				usbd_set_addr(cdc_address);
				//in_res should be set to NAK automatically
				break;
			default:
				usbd_set_tx_len(EP_0, 0);
				//in_res should be set to NAK automatically
				break;
			}
		}
		else
		{
			usbd_set_tx_len(EP_0, 0);
			//in_res should be set to NAK automatically
		}
	}

	if(ep == EP_1)
	{
		usbd_set_tx_len(EP_1, 0);
		//in_res should be set to NAK automatically
		cdc_last_status_time = sof_count;
	}

