SteveLRojas/MC-10_Tape_Emulator/SW/tape_emulator/user_libs/ch32v203_usbd_cdc.c
	if(ep == EP_3)
	{
		//usbd_set_tx_len(EP_3, CDC_ENDP3_SIZE);
		//auto-toggle is enabled, so here the toggle should point to the next buffer that will transmit
		if(usbd_get_in_toggle(EP_3))
		{
			ep3_t0_num_bytes = 0;
			usbd_set_tx_0_len(EP_3, 0);
		}
		else
		{
			ep3_t1_num_bytes = 0;
			usbd_set_tx_1_len(EP_3, 0);
		}
		usbd_set_out_toggle(EP_3, ep3_write_select ? USBD_OUT_TOG_1 : USBD_OUT_TOG_0);
		cdc_last_data_time = sof_count;
	}
}

void cdc_on_setup(uint8_t ep)
{
	uint8_t len;

	if(ep == EP_0)
	{
		usbd_read_from_pma(usbd_get_rx_buf_offset(EP_0), (uint16_t*)(&cdc_setup_buf), 4);
		descriptor_ptr = 0;
		len = 0;

		if((cdc_setup_buf.bRequestType & USB_REQ_TYP_MASK) == USB_REQ_TYP_STANDARD)
		{
			switch(cdc_setup_buf.bRequest)
			{
			case USB_GET_STATUS:
				usbd_write_pma_word(usbd_get_tx_buf_offset(EP_0), 0);
				len = 2;
				break;
			case USB_CLEAR_FEATURE:
				if((cdc_setup_buf.bRequestType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP)
				{
					switch((uint8_t)(cdc_setup_buf.wIndex))
					{
					case 0x81:
						usbd_set_in_toggle(EP_1, USBD_IN_TOG_0);
						usbd_set_in_res(EP_1, USBD_IN_RES_NAK);
						break;
					case 0x02:
						usbd_set_out_toggle(EP_2, USBD_OUT_TOG_0);
						usbd_set_out_res(EP_2, USBD_OUT_RES_ACK);
						break;
					case 0x83:
						usbd_set_in_toggle(EP_3, USBD_IN_TOG_0);
						usbd_set_in_res(EP_3, USBD_IN_RES_NAK);
						break;
					default:
						len = 0xFF;
					}
				}
				else
				{
					len = 0xFF;
				}
				break;
			case USB_SET_FEATURE:
				if(((cdc_setup_buf.bRequestType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP) && !(cdc_setup_buf.wIndex & 0xFF00))
				{
					switch((uint8_t)(cdc_setup_buf.wIndex))
					{
					case 0x81:
						usbd_set_in_toggle(EP_1, USBD_IN_TOG_0);
						usbd_set_in_res(EP_1, USBD_IN_RES_STALL);
						break;
					case 0x02:
						usbd_set_out_toggle(EP_2, USBD_OUT_TOG_0);
						usbd_set_out_res(EP_2, USBD_OUT_RES_STALL);
						break;
					case 0x83:
						usbd_set_in_toggle(EP_3, USBD_IN_TOG_0);
						usbd_set_in_res(EP_3, USBD_IN_RES_STALL);
						break;
					default:
						len = 0xFF;
					}
				}
				else
				{
					len = 0xFF;
				}
				break;
			case USB_SET_ADDRESS:
				cdc_address = (uint8_t)(cdc_setup_buf.wValue);
				break;
			case USB_GET_DESCRIPTOR:
				switch((uint8_t)(cdc_setup_buf.wValue >> 8))
				{
				case USB_DESCR_TYP_DEVICE:
					descriptor_ptr = cdc_device_descriptor;
					len = CDC_DEV_DESCR_SIZE;
					break;
				case USB_DESCR_TYP_CONFIG:
					descriptor_ptr = cdc_config_descriptor;
					len = CDC_CONF_DESCR_SIZE;
					break;
				case USB_DESCR_TYP_STRING:
					switch((uint8_t)(cdc_setup_buf.wValue))
					{
						case 0:
							descriptor_ptr = cdc_string_lang_id;
							break;
						case 1:
							descriptor_ptr = cdc_string_vendor;
							break;
						case 2:
							descriptor_ptr = cdc_string_product;
							break;
						case 3:
							descriptor_ptr = cdc_string_serial;
							break;
						case 4:
							descriptor_ptr = cdc_string_product;
							break;
						default:
							descriptor_ptr = cdc_string_serial;
							break;
					}
					len = descriptor_ptr[0];
					break;
				default:
					len = 0xFF;
					break;
				}
				break;
			case USB_GET_CONFIGURATION:
				usbd_write_pma_word(usbd_get_tx_buf_offset(EP_0), (uint16_t)cdc_config);
				len = 1;
				break;
			case USB_SET_CONFIGURATION:
				cdc_config = (uint8_t)(cdc_setup_buf.wValue);
				break;
			case USB_GET_INTERFACE:
				usbd_write_pma_word(usbd_get_tx_buf_offset(EP_0), 0);
				len = 1;
				break;
			case USB_SET_INTERFACE:
				//nothing to do here
				break;
			default:
				len = 0xFF;
				break;
			}
		}
		else if((cdc_setup_buf.bRequestType & USB_REQ_TYP_MASK) == USB_REQ_TYP_CLASS)
		{
			switch(cdc_setup_buf.bRequest)
			{
			case GET_LINE_CODING:
				usbd_write_to_pma(usbd_get_tx_buf_offset(EP_0), (uint16_t*)(&cdc_line_coding), (CDC_LINE_CODING_SIZE + 1) >> 1);
				len = CDC_LINE_CODING_SIZE;
				break;
			case SET_CONTROL_LINE_STATE:
				cdc_control_line_state = (uint8_t)(cdc_setup_buf.wValue);
				break;
			case SET_LINE_CODING:
				// nothing to do here
				break;
			default:
				len = 0xFF;
				break;
			}
		}
		else
		{
			len = 0xFF;
		}	// end if((hid_setup_buf.bRequestType & USB_REQ_TYP_MASK) == USB_REQ_TYP_STANDARD)

		if(len == 0xFF)
		{
			cdc_setup_buf.bRequest = 0xFF;
			usbd_set_tog_res(EP_0, USBD_OUT_TOG_1 | USBD_IN_TOG_1 | USBD_OUT_RES_STALL | USBD_IN_RES_STALL);
		}
		else
		{
			if(cdc_setup_buf.wLength > len)
				cdc_setup_buf.wLength = len;
			len = (cdc_setup_buf.wLength > CDC_ENDP0_SIZE) ? CDC_ENDP0_SIZE : cdc_setup_buf.wLength;

			if(descriptor_ptr)
			{
				usbd_write_to_pma(usbd_get_tx_buf_offset(EP_0), (uint16_t*)descriptor_ptr, (len + 1) >> 1);
				descriptor_ptr += len;
			}

			cdc_setup_buf.wLength -= len;
			usbd_set_tx_len(EP_0, len);
			usbd_set_tog_res(EP_0, USBD_OUT_TOG_1 | USBD_IN_TOG_1 | USBD_OUT_RES_ACK | USBD_IN_RES_ACK);
		}
	}	// end if(ep == EP_0)
}

void cdc_on_rst(void)
{
	ep2_read_select = 0;	//EP_2 IN toggle must be initialized to 1 (RX initially enabled)
	ep2_t0_num_bytes = 0;
	ep2_t0_read_offset = 0;
	ep2_t1_num_bytes = 0;
	ep2_t1_read_offset = 0;

	ep3_wip = 0;
	ep3_write_select = 0;	//EP_3 OUT toggle must be initialized to 0 (TX initially disabled)
	ep3_t0_num_bytes = 0;
	ep3_t1_num_bytes = 0;

	usbd_set_tog_res(EP_0, USBD_OUT_RES_ACK | USBD_IN_RES_NAK | USBD_OUT_TOG_0 | USBD_IN_TOG_0);
	usbd_set_tog_res(EP_1, USBD_OUT_RES_ACK | USBD_IN_RES_NAK | USBD_OUT_TOG_0 | USBD_IN_TOG_0);
	usbd_set_tog_res(EP_2, USBD_OUT_RES_ACK | USBD_IN_RES_DISABLED | USBD_OUT_TOG_0 | USBD_IN_TOG_1);
	usbd_set_tog_res(EP_3, USBD_OUT_RES_DISABLED | USBD_IN_RES_NAK | USBD_OUT_TOG_0 | USBD_IN_TOG_0);

	cdc_last_data_time = 0;
	cdc_last_status_time = 0;
	sof_count = 0;
}

//TODO: move these functions to the USBD library and use the DMA controller
void usbd_write_bytes_to_pma(uint16_t byte_offset, const uint8_t* source, uint16_t num_bytes)
{
	uint16_t* pma = (uint16_t*)(USBD_PMA_BASE + (byte_offset & 0xFFFE));
	uint16_t num_words;
	uint16_t pma_word;

	if(byte_offset & 0x01)
	{
		pma_word = *pma;
		((uint8_t*)(&pma_word))[1] = *source;
		*pma = pma_word;
		--num_bytes;
		pma += 2;
		++source;
	}

