SteveLRojas/MC-10_Tape_Emulator/SW/tape_emulator/user_libs/ch32v203_usbd_cdc.c
	num_words = num_bytes >> 1;
	while(num_words--)
	{
		((uint8_t*)(&pma_word))[0] = *source;
		++source;
		((uint8_t*)(&pma_word))[1] = *source;
		++source;
		*pma = pma_word;
		pma += 2;
	}

	if(num_bytes & 0x01)
	{
		*pma = (uint16_t)(*source);
	}
}

void usbd_read_bytes_from_pma(uint16_t byte_offset, uint8_t* dest, uint16_t num_bytes)
{
	uint16_t* pma = (uint16_t*)(USBD_PMA_BASE + (byte_offset & 0xFFFE));
	uint16_t num_words;
	uint16_t pma_word;

	if(byte_offset & 0x01)
	{
		*dest = (uint8_t)(*pma >> 8);
		--num_bytes;
		pma += 2;
		++dest;
	}

	num_words = num_bytes >> 1;
	while(num_words--)
	{
		pma_word = *pma;
		*dest = ((uint8_t*)(&pma_word))[0];
		++dest;
		*dest = ((uint8_t*)(&pma_word))[1];
		++dest;
		pma += 2;
	}

	if(num_bytes & 0x01)
	{
		*dest = (uint8_t)(*pma);
	}
}

static const usbd_config_t usbd_config =
{
	{CDC_ENDP0_SIZE, CDC_ENDP1_SIZE, 0, CDC_ENDP3_SIZE, 0, 0, 0, 0},
	{CDC_ENDP0_SIZE, 0, CDC_ENDP2_SIZE, 0, 0, 0, 0, 0},
	{USBD_EP_TYPE_CONTROL, USBD_EP_TYPE_INTERRUPT, USBD_EP_TYPE_BULK_DBL, USBD_EP_TYPE_BULK_DBL, USBD_EP_TYPE_BULK, USBD_EP_TYPE_BULK, USBD_EP_TYPE_BULK, USBD_EP_TYPE_BULK},
	USBD_INT_TRANSFER | USBD_INT_RESET | USBD_INT_SOF
};

void cdc_init(void)
{
	usbd_sof_callback = cdc_on_sof;
	usbd_esof_callback = 0;
	usbd_out_callback = cdc_on_out;
	usbd_in_callback = cdc_on_in;
	usbd_setup_callback = cdc_on_setup;
	usbd_reset_callback = cdc_on_rst;
	usbd_wakeup_callback = 0;
	usbd_suspend_callback = 0;

	usbd_init(&usbd_config);
	cdc_set_serial_state(0x00);
}

void cdc_set_serial_state(uint8_t val)
{
	usbd_write_to_pma(usbd_get_tx_buf_offset(EP_1), (uint16_t*)cdc_serial_state, (CDC_SERIAL_STATE_SIZE + 1) >> 1);
	usbd_write_pma_word(usbd_get_tx_buf_offset(EP_1) + 8, (uint16_t)val);
	usbd_set_tx_len(EP_1, CDC_SERIAL_STATE_SIZE);
	usbd_set_in_res(EP_1, USBD_IN_RES_ACK);
}

// Receive
uint16_t cdc_bytes_available(void)
{
	// count the number of bytes available in both buffers
	return (ep2_t0_num_bytes - ep2_t0_read_offset) + (ep2_t1_num_bytes - ep2_t1_read_offset);
}

uint8_t cdc_peek(void)
{
	uint16_t pma_word;
	uint8_t byte_select;

	if(ep2_read_select)
	{
		pma_word = usbd_read_pma_word(usbd_get_rx_1_buf_offset(EP_2) + (ep2_t1_read_offset & 0xFE));
		byte_select = ep2_t1_read_offset & 0x01;
	}
	else
	{
		pma_word = usbd_read_pma_word(usbd_get_rx_0_buf_offset(EP_2) + (ep2_t0_read_offset & 0xFE));
		byte_select = ep2_t0_read_offset & 0x01;
	}
	return ((uint8_t*)(&pma_word))[byte_select];
}

uint8_t cdc_read_byte(void)
{
	uint16_t pma_word;
	uint8_t byte_select;

	while(!cdc_bytes_available());

	if(ep2_read_select)
	{
		pma_word = usbd_read_pma_word(usbd_get_rx_1_buf_offset(EP_2) + (ep2_t1_read_offset & 0xFE));
		byte_select = ep2_t1_read_offset & 0x01;
		++ep2_t1_read_offset;
		if(ep2_t1_read_offset == ep2_t1_num_bytes)
		{
			ep2_t1_read_offset = 0;
			ep2_t1_num_bytes = 0;
			ep2_read_select = 0;
			if((usbd_get_out_toggle(EP_2) && usbd_get_in_toggle(EP_2)) || (!usbd_get_out_toggle(EP_2) && !usbd_get_in_toggle(EP_2)))
			{
				usbd_set_in_toggle(EP_2, USBD_IN_TOG_0);
				usbd_set_out_res(EP_2, USBD_OUT_RES_ACK);
			}
		}
	}
	else
	{
		pma_word = usbd_read_pma_word(usbd_get_rx_0_buf_offset(EP_2) + (ep2_t0_read_offset & 0xFE));
		byte_select = ep2_t0_read_offset & 0x01;
		++ep2_t0_read_offset;
		if(ep2_t0_read_offset == ep2_t0_num_bytes)
		{
			ep2_t0_read_offset = 0;
			ep2_t0_num_bytes = 0;
			ep2_read_select = 1;
			if((usbd_get_out_toggle(EP_2) && usbd_get_in_toggle(EP_2)) || (!usbd_get_out_toggle(EP_2) && !usbd_get_in_toggle(EP_2)))
			{
				usbd_set_in_toggle(EP_2, USBD_IN_TOG_1);
				usbd_set_out_res(EP_2, USBD_OUT_RES_ACK);
			}
		}
	}
	return ((uint8_t*)(&pma_word))[byte_select];
}

void cdc_read_bytes(uint8_t* dest, uint16_t num_bytes)
{
	uint16_t num_to_read;

	while(num_bytes)
	{
		if(ep2_read_select)
		{
			num_to_read = ep2_t1_num_bytes - ep2_t1_read_offset;
			if(!num_to_read)
				continue;
			if(num_to_read > num_bytes)
			{
				num_to_read = num_bytes;
			}

			num_bytes -= num_to_read;
			usbd_read_bytes_from_pma((usbd_get_rx_1_buf_offset(EP_2) << 1) + ep2_t1_read_offset, dest, num_to_read);

			if(ep2_t1_read_offset == ep2_t1_num_bytes)
			{
				ep2_t1_read_offset = 0;
				ep2_t1_num_bytes = 0;
				ep2_read_select = 0;
				if((usbd_get_out_toggle(EP_2) && usbd_get_in_toggle(EP_2)) || (!usbd_get_out_toggle(EP_2) && !usbd_get_in_toggle(EP_2)))
				{
					usbd_set_in_toggle(EP_2, USBD_IN_TOG_0);
					usbd_set_out_res(EP_2, USBD_OUT_RES_ACK);
				}
			}
		}
		else
		{
			num_to_read = ep2_t0_num_bytes - ep2_t0_read_offset;
			if(!num_to_read)
				continue;
			if(num_to_read > num_bytes)
			{
				num_to_read = num_bytes;
			}

			num_bytes -= num_to_read;
			usbd_read_bytes_from_pma((usbd_get_rx_0_buf_offset(EP_2) << 1) + ep2_t0_read_offset, dest, num_to_read);

			if(ep2_t0_read_offset == ep2_t0_num_bytes)
			{
				ep2_t0_read_offset = 0;
				ep2_t0_num_bytes = 0;
				ep2_read_select = 1;
				if((usbd_get_out_toggle(EP_2) && usbd_get_in_toggle(EP_2)) || (!usbd_get_out_toggle(EP_2) && !usbd_get_in_toggle(EP_2)))
				{
					usbd_set_in_toggle(EP_2, USBD_IN_TOG_1);
					usbd_set_out_res(EP_2, USBD_OUT_RES_ACK);
				}
			}
		}
	}
}

// Send
uint16_t cdc_bytes_available_for_write(void)
{
	return (CDC_ENDP3_SIZE - ep3_t0_num_bytes) + (CDC_ENDP3_SIZE - ep3_t1_num_bytes);
}

void cdc_write_byte(uint8_t val)
{
	uint16_t pma_word;
	uint8_t ep_num_bytes;

	ep3_wip = 1;
	if(ep3_write_select)
	{
		ep_num_bytes = ep3_t1_num_bytes;
		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			ep3_wip = 0;
			return;
		}

		pma_word = usbd_read_pma_word(usbd_get_tx_1_buf_offset(EP_3) + (ep_num_bytes & 0xFE));
		((uint8_t*)(&pma_word))[ep_num_bytes & 0x01] = val;
		usbd_write_pma_word(usbd_get_tx_1_buf_offset(EP_3) + (ep_num_bytes & 0xFE), pma_word);
		++ep_num_bytes;
		ep3_t1_num_bytes = ep_num_bytes;

		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			usbd_set_tx_1_len(EP_3, CDC_ENDP3_SIZE);
			ep3_write_select = 0;
			if((usbd_get_out_toggle(EP_3) && usbd_get_in_toggle(EP_3)) || (!usbd_get_out_toggle(EP_3) && !usbd_get_in_toggle(EP_3)))
			{
				usbd_set_out_toggle(EP_3, USBD_OUT_TOG_0);
				usbd_set_in_res(EP_3, USBD_IN_RES_ACK);
			}
		}
	}
	else
	{
		ep_num_bytes = ep3_t0_num_bytes;
		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			ep3_wip = 0;
			return;
		}

		pma_word = usbd_read_pma_word(usbd_get_tx_0_buf_offset(EP_3) + (ep_num_bytes & 0xFE));
		((uint8_t*)(&pma_word))[ep_num_bytes & 0x01] = val;
		usbd_write_pma_word(usbd_get_tx_0_buf_offset(EP_3) + (ep_num_bytes & 0xFE), pma_word);
		++ep_num_bytes;
		ep3_t0_num_bytes = ep_num_bytes;

		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			usbd_set_tx_0_len(EP_3, CDC_ENDP3_SIZE);
			ep3_write_select = 1;
			if((usbd_get_out_toggle(EP_3) && usbd_get_in_toggle(EP_3)) || (!usbd_get_out_toggle(EP_3) && !usbd_get_in_toggle(EP_3)))
			{
				usbd_set_out_toggle(EP_3, USBD_OUT_TOG_1);
				usbd_set_in_res(EP_3, USBD_IN_RES_ACK);
			}
		}
	}
	ep3_wip = 0;
}

void cdc_write_bytes(const uint8_t* src, uint16_t num_bytes)
{
	uint16_t num_to_write;
	uint8_t ep_num_bytes;

