SteveLRojas/MC-10_Tape_Emulator/SW/tape_emulator/user_libs/ch32v203_usbd_cdc.c
	ep3_wip = 1;
	while(num_bytes)
	{
		if(ep3_write_select)
		{
			ep_num_bytes = ep3_t1_num_bytes;
			num_to_write = CDC_ENDP3_SIZE - ep_num_bytes;
			if(!num_to_write)
				continue;
			if(num_to_write > num_bytes)
				num_to_write = num_bytes;

			num_bytes -= num_to_write;
			usbd_write_bytes_to_pma((usbd_get_tx_1_buf_offset(EP_3) << 1) + ep_num_bytes, src, num_to_write);
			ep3_t1_num_bytes = ep_num_bytes;

			if(ep_num_bytes == CDC_ENDP3_SIZE)
			{
				usbd_set_tx_1_len(EP_3, CDC_ENDP3_SIZE);
				ep3_write_select = 0;
				if((usbd_get_out_toggle(EP_3) && usbd_get_in_toggle(EP_3)) || (!usbd_get_out_toggle(EP_3) && !usbd_get_in_toggle(EP_3)))
				{
					usbd_set_out_toggle(EP_3, USBD_OUT_TOG_0);
					usbd_set_in_res(EP_3, USBD_IN_RES_ACK);
				}
			}
		}
		else
		{
			ep_num_bytes = ep3_t0_num_bytes;
			num_to_write = CDC_ENDP3_SIZE - ep_num_bytes;
			if(!num_to_write)
				continue;
			if(num_to_write > num_bytes)
				num_to_write = num_bytes;

			num_bytes -= num_to_write;
			usbd_write_bytes_to_pma((usbd_get_tx_0_buf_offset(EP_3) << 1) + ep_num_bytes, src, num_to_write);
			ep3_t0_num_bytes = ep_num_bytes;

			if(ep_num_bytes == CDC_ENDP3_SIZE)
			{
				usbd_set_tx_0_len(EP_3, CDC_ENDP3_SIZE);
				ep3_write_select = 1;
				if((usbd_get_out_toggle(EP_3) && usbd_get_in_toggle(EP_3)) || (!usbd_get_out_toggle(EP_3) && !usbd_get_in_toggle(EP_3)))
				{
					usbd_set_out_toggle(EP_3, USBD_OUT_TOG_1);
					usbd_set_in_res(EP_3, USBD_IN_RES_ACK);
				}
			}
		}
	}
	ep3_wip = 0;
}
